tutorials/hybridCentralFoam/incompressible/meshMotion/oscillatingInlet/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
    ACMI2_blockage
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
