tutorials/hybridCentralFoam/incompressible/meshMotion/oscillatingInlet/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e+5;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e+5;
    }
    walls
    {
        type            zeroGradient;
    }
    couple1
    {
        type            zeroGradient;
    }
    couple2
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            zeroGradient;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 1e+5;
    }
    ACMI2_blockage
    {
        type            zeroGradient;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 1e+5;
    }
}


// ************************************************************************* //
